app/Http/Controllers/ApCarParkController.php

select * from `ap_carpark` where `ap_carpark`.`deleted_at` is null
---
    public function index()
    {
        $config['list'] = ApCarPark::get()->toArray();

select * from `ap_carpark` where `ap_carpark`.`id` = '0' limit 1
---
    public function show($id)
    {
        $config['car']= ApCarPark::find($id)->toArray();